app/controllers/fruits_controller.rb

SELECT "fruits".* FROM "fruits"
---
  def index
    @fruits = Fruit.all

INSERT INTO "fruits" ("name", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Apple"], ["color", "Red"], ["created_at", "2024-11-18 05:44:01.613376"], ["updated_at", "2024-11-18 05:44:01.613376"]]
---
  def create
    @fruit = Fruit.new(fruit_params)

    respond_to do |format|
      if @fruit.save

SELECT "fruits".* FROM "fruits" WHERE "fruits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_fruit
      @fruit = Fruit.find(params[:id])